/* Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number). */


public class Main {

    public static void main(String[] args) {
   int number =5;
  

   System.out.println(nummber*number);

    }

    }
