/* Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number). */


public class Main {

    public static void main(String[] args) {
   int num1 =5;
   int num2 =5;

   System.out.println(num1*num2);

    }

    }
