public class Main {
    public static void main(String[] args) {
        String name = "Viny";
        int age =3;
        String city = "Moscow";
        System.out.println("Имя "+name+" Возраст " +age+" Город "+city);
    }
}


       // Система . из . печать ( " два " );

        Система . из . печать (б);

        Система . из . печать ( " плюс " );

       // Система . из . печать ( " минус " );

        Система . из . печать (а);

       //Система . из . print ( " три " );

        Система . из . печать ( " равно " );

        //Система . из . печать ( " будет " );

        Система . из . печать ( " пять " );

        //Система . из . печать (а + б);
    }
}
